# MySQL

Sebelum memulai, pastikan sudah :
- Install Laragon
- Start All pada Laragon
- Install PyMySQL dengan cara: conda install pymysql
- Import database mysqlsampledatabase.sql pada HeidiSQL melalui Tombol Database pada Laragon

In [ ]:
import os
import pymysql
import pandas as pd

host = '127.0.0.1'
port = "3306"
user = 'root'
password = ''
database = 'classicmodels'

conn = pymysql.connect(
    host=host,
    port=int(port),
    user=user,
    passwd=password,
    db=database,
    charset='utf8mb4')

def run(sql):
    df = pd.read_sql_query(sql,conn)
    return df

## Berikut adalah Skema Database dari Sample Database yang telah kita Import dengan nama database Classicmodels:

<img src="http://www.mysqltutorial.org/wp-content/uploads/2009/12/MySQL-Sample-Database-Schema.png" />

In [ ]:
run("SHOW TABLES")

## 1. Mengambil dan Memilih data dengan SELECT

In [ ]:
run("SELECT * FROM products")

In [ ]:
run("SELECT productName,buyPrice FROM products")

In [ ]:
run("SELECT firstName,lastName FROM employees")

In [ ]:
run("SELECT CONCAT(firstName,' ',lastName) AS fullName FROM employees")

In [ ]:
run("SELECT * FROM orders")

In [ ]:
run("SELECT orderNumber,YEAR(orderDate),MONTH(orderDate),DAY(orderDate) FROM orders")

In [ ]:
# DISTINCT : Lihat Perbedaan dari Query dibawah ini
run("SELECT lastName FROM employees")
# run("SELECT DISTINCT lastName FROM employees")

## 2. Kondisi dengan WHERE

In [ ]:
run("SELECT productName,buyPrice FROM products WHERE buyPrice>50")

In [ ]:
run("SELECT productName,buyPrice FROM products WHERE buyPrice BETWEEN 50 AND 60")

In [ ]:
run("SELECT firstName,lastName,jobTitle,officeCode FROM employees WHERE jobTitle='Sales Rep'")

In [ ]:
run("SELECT firstName,lastName,jobTitle,officeCode FROM employees WHERE jobTitle IN ('Sales Rep','VP Sales')")

In [ ]:
run("SELECT firstName,lastName,jobTitle,officeCode FROM employees WHERE jobTitle<>'Sales Rep'")

In [ ]:
run("SELECT firstName,lastName,jobTitle,officeCode FROM employees WHERE jobTitle='Sales Rep' AND officeCode=1")

In [ ]:
run("""
SELECT firstName,lastName,jobTitle,officeCode 
FROM employees 
WHERE jobTitle='Sales Rep' AND officeCode=1 AND lastName='Thompson'
""")

In [ ]:
run("""
SELECT   customername,
         country,
         state,
         creditlimit
FROM customers
WHERE country = 'USA'
        AND state = 'CA'
        AND creditlimit > 100000
""")

In [ ]:
run("SELECT firstName,lastName,jobTitle,officeCode FROM employees WHERE jobTitle<>'Sales Rep' OR officeCode=1")

In [ ]:
run("""
SELECT 
    customername, country
FROM
    customers
WHERE
    country = 'USA' OR country = 'France';
""")

## 3. Mengurutkan Hasil dengan Order By

In [ ]:
run("SELECT productName,productLine,buyPrice FROM products WHERE buyPrice>30 ORDER BY buyPrice")

In [ ]:
run("SELECT productName,productLine,buyPrice FROM products WHERE buyPrice>30 ORDER BY buyPrice DESC")

In [ ]:
run("SELECT productName,productLine,buyPrice FROM products WHERE buyPrice>30 ORDER BY productLine,buyPrice")

## 4. Membatasi Hasil Dengan Limit

In [ ]:
run("SELECT productName,productLine,buyPrice FROM products WHERE buyPrice>30 ORDER BY productLine,buyPrice LIMIT 0,10")

In [ ]:
run("SELECT productName,productLine,buyPrice FROM products WHERE buyPrice>30 ORDER BY productLine,buyPrice LIMIT 10,10")

## 5. Pencarian String

In [ ]:
run("""
SELECT 
    employeeNumber, 
    lastName, 
    firstName
FROM
    employees
WHERE
    firstName LIKE 'a%'
""")

In [ ]:
run("""
SELECT 
    employeeNumber, 
    lastName, 
    firstName
FROM
    employees
WHERE
    lastName LIKE '%on'
""")

In [ ]:
run("""
SELECT 
    employeeNumber, 
    lastName, 
    firstName
FROM
    employees
WHERE
    lastname LIKE '%on%'
""")

In [ ]:
run("""
SELECT 
    employeeNumber, 
    lastName, 
    firstName
FROM
    employees
WHERE
    firstname LIKE 'T_m'
""")

In [ ]:
run("""
SELECT 
    employeeNumber, 
    lastName, 
    firstName
FROM
    employees
WHERE
    lastName NOT LIKE 'B%'
""")

In [ ]:
run("""
SELECT 
    productCode, 
    productName
FROM
    products
WHERE
    productCode LIKE '%\_20%';
""")

Jika membutuhkan Pencarian yang lebih advanced dapat menggunakan BOOLEAN Text Search atau NATURAL LANGUAGE Search:
- http://www.mysqltutorial.org/mysql-boolean-text-searches.aspx
- http://www.mysqltutorial.org/mysql-natural-language-search.aspx

## 6. Query Agregasi
SUM, COUNT, AVG, MIN, MAX + GROUP BY + HAVING

In [ ]:
run("SELECT AVG(buyPrice) AS RataHarga FROM products")

In [ ]:
run("SELECT productLine,AVG(buyPrice) AS RataHarga FROM products GROUP BY productLine")

In [ ]:
run("SELECT productLine,AVG(buyPrice) AS RataHarga FROM products GROUP BY productLine HAVING RataHarga>50")

In [ ]:
run("SELECT productLine,MIN(buyPrice) AS HargaTermurah FROM products GROUP BY productLine")

In [ ]:
run("SELECT productLine,MAX(buyPrice) AS HargaTermahal FROM products GROUP BY productLine")

In [ ]:
run("SELECT productLine,COUNT(*) AS JumlahProduk FROM products GROUP BY productLine")

In [ ]:
run("SELECT YEAR(paymentDate) AS Tahun,SUM(amount) AS TotalBayar FROM payments GROUP BY YEAR(paymentDate)")

In [ ]:
run("""
SELECT 
    YEAR(paymentDate) AS Tahun,
    MONTH(paymentDate) AS Bulan,
    SUM(amount) AS TotalBayar 
FROM payments 
GROUP BY Tahun,Bulan
""")

In [ ]:
run("""
SELECT 
    YEAR(paymentDate) AS Tahun,
    MONTH(paymentDate) AS Bulan,
    SUM(amount) AS TotalBayar 
FROM payments 
GROUP BY Tahun,Bulan
HAVING TotalBayar > 300000
ORDER BY TotalBayar DESC
""")

## SELF STUDY
Materi Digital Talent untuk SQL hanya 3 pertemuan, sehingga hanya cukup untuk menyampaikan SELECT saja, namun kalian belum melihat bagaimana cara untuk membuat Tabel, Kolom, serta Bagaimana melakukan manipulasi Data, berikut materi tambahan untuk dapat memanipulasi data:

- https://www.youtube.com/playlist?list=PLF82-I80PwDN7KSzsJOmd8mwHYe4aAqfF

Playlist dari #1 hingga #10